cleanli2/stm32/src/common.c
#include "stm32f10x.h"
#include "board.h"
#include "common.h"
#include "cmd.h"
#include "lprintf.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "sd/stm32_eval_spi_sd.h"
#include "os_task.h"
#include "ring_buf.h"
#include "display.h"

/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */

/** @addtogroup GPIO_IOToggle
  * @{
  */
extern unsigned long debug_enable;

u32 intrpt_time[NUM_INTRPT]={0};
u32 debug_mode = 0;
DECLARE_OS_LOCK(oslk_evt, EVT_LOCK_NO);
DECLARE_RB_DATA(evt, rb_evt, 3)
#define COUNTS_PER_US 6

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
GPIO_InitTypeDef GPIO_InitStructure;
USART_InitTypeDef USART_InitStructure;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

u32 last_systick;
u32 interv_systick;
static int sound_enable=1;
static uint32_t g_10ms_count = 0;
uint32_t g_ms_count = 0;
void os_task1(void*);
void os_task2(void*);
void os_task3(void*);
void compute_cpu_occp();



/*led8s display*/
extern date_info_t g_cur_date;
#define LED8S_LASTDELAY (LED8S_INTV_PER_SECOND*1) //delay when move to end
#define LED8S_INTV 1 //interval between each move
#define LED8S_INTV_PER_SECOND 9 //interval between each move
static uint date_move_direction_led8s=1;//1-to right 0-to left
static int date_pos_led8s=0;
static uint date_ct_led8s=0;
static uint date_ct_led8s_lastdelay=LED8S_LASTDELAY;

#define SHOWSTR_LEN 25
#define MAX_SHOW_LEN 15
static uint switch_count=0;
static int last_switch_status=0;
static uint64_t otc=0;
char showstr[SHOWSTR_LEN];
void get_otc()
{
    uint tmp=0;
    uint32_t o1=otc>>32, o2=otc&0xffffffff;
    while(tmp==0){
        tmp=0xffff&get_system_us();
    }
    lprintf("%X\n", tmp);
    lprintf_time("b otc=%W\n", otc);
    otc<<=16;
    lprintf_time("b2 otc=%W\n", otc);
    otc+=tmp;
    lprintf_time("otc=%W\n", otc);
    o1=otc>>32;
    o2=otc&0xffffffff;
    lprintf("%X %X   \n", o1, o2);
    lprintf("%X%X   \n", 0x33445566, 0xaabbccdd);
}
void led8s_task(void*p)
{
    uint intv;
    int len_ss;
    int switch_status=0;
    uint32_t o1=otc>>32, o2=otc&0xffffffff;
    char t[8], *ts;
    (void)p;
    while(1){
        os_ms_delay(50);

        switch_status=GET_SWITCH_STA();
        //lprintf("sw%d\n", switch_status);
        if((!last_switch_status) && switch_status){
            switch_count++;
            lprintf_time("SW++=%d-@%s!\n", switch_count, get_rtc_time(&g_cur_date));
            if(otc<0x1000000000000)get_otc();
        }
        last_switch_status = switch_status;

        if(switch_status){
            o1=otc>>32;
            o2=otc&0xffffffff;
            slprintf(showstr, "%X%X    ", o1, o2);
            intv=LED8S_INTV*5;
            slprintf(showstr+20, "%d", switch_count);
            len_ss=strlen(showstr);
            while(len_ss<SHOWSTR_LEN-1){
                showstr[len_ss++]=' ';
            }
        }
        else{
            slprintf(showstr, "%s", get_rtc_time(&g_cur_date));
            intv=LED8S_INTV;
            slprintf(showstr+20, "%d", switch_count);
            len_ss=strlen(showstr);
            memcpy(t, showstr+11, 8);
            //lprintf("---1|%s\n", showstr);
            memset(showstr+11, ' ', 5);
            //lprintf("---2|%s\n", showstr);
            //lprintf("len_ss=%d\n", len_ss);
            len_ss-=20;
            ts=showstr+14-len_ss;
            while(len_ss){
                ts[len_ss]=showstr[19+len_ss];
                len_ss--;
            }
            //lprintf("---3|%s\n", showstr);
            memcpy(showstr+16, t, 8);
        }
        //lprintf("----|%s\n", showstr);
        if(date_ct_led8s++>intv){
            date_ct_led8s=0;
            if(date_move_direction_led8s){
                if(date_pos_led8s++>MAX_SHOW_LEN-1){
                    date_pos_led8s=MAX_SHOW_LEN;
                    if(date_ct_led8s_lastdelay--==0){
                        date_ct_led8s_lastdelay=LED8S_LASTDELAY;
                        date_move_direction_led8s=!date_move_direction_led8s;
                        GPIO_ResetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
                    }
                }
                if(showstr[date_pos_led8s]=='.' ||
                        showstr[date_pos_led8s]==':')
                    date_pos_led8s++;
            }
            else{
                if(date_pos_led8s--<=0){
                    date_pos_led8s=0;
                    if(date_ct_led8s_lastdelay--==0){
                        date_ct_led8s_lastdelay=LED8S_LASTDELAY;
                        date_move_direction_led8s=!date_move_direction_led8s;
                        GPIO_SetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
                        if(min_zero()){
                            auto_time_correct_10s();
                        }
                    }
                }
                if(showstr[date_pos_led8s]=='.' ||
                        showstr[date_pos_led8s]==':')
                    if(date_pos_led8s!=0)
                        date_pos_led8s--;
            }
            //prt_hex(date_move_direction_led8s);
            //prt_hex(date_ct_led8s_lastdelay);
            lcd_lprintf(1, 0x10000,0,showstr+date_pos_led8s);
        }
    }
}
/*led8s display end*/


#if 0
struct emulate_touch g_fake_touch = {0};
struct emulate_touch *gftp=&g_fake_touch;
void os_touch(void*p)
{
    struct point pt;
    struct point pt_cache;
    int touch_pressed = 0;
    (void)p;
    while(1){
        if(gftp->n_pt && gftp->pts){
            u32 test_time;
            gftp->cur_interval++;
            if(gftp->cur_interval >= gftp->interval){
                gftp->cur_interval = 0;
                if(gftp->cur_n_pt >= gftp->n_pt){
                    gftp->cur_n_pt = 0;
                }
                pt_cache = gftp->pts[gftp->cur_n_pt++];
                touch_pressed = 1;
                test_time = g_ms_count-gftp->start;
                if(gftp->last*60*1000u < test_time){//test done
                    gftp->pts =NULL;
                    lprintf("##########stress test end %s\n", get_rtc_time(0));
                    lprintf("##########stress test time long %d mins %d s %d ms\n",
                            test_time/1000/60,
                            (test_time/1000)%60, test_time%1000);
                }
            }
        }
        if(touch_down()){
            touch_pressed = 1;
            if(get_TP_point(&pt.px, &pt.py)){
                //lprintf("touch: %d %d\n", pt.px, pt.py);
                pt_cache = pt;
            }
        }
        else{
            if(touch_pressed == 1){
                os_lock(&oslk_evt);
                evt *dtw=RB_W_GET_wait(evt, rb_evt);
                //do work
                dtw->type = EVT_SCRN_TOUCH_UP;
                memcpy(dtw->pkg, &pt_cache, sizeof(struct point));
                RB_W_SET(evt, rb_evt);
                os_unlock(&oslk_evt);
            }
            touch_pressed = 0;
        }
        os_ms_delay(20);
    }
}
#endif
static inline u32 get_sp()
{
    register u32 __reg_sp __asm("sp");
    return (__reg_sp);
}

int get_sound_sta()
{
    return sound_enable;
}
void enable_sound(int en)
{
    sound_enable = en;
}
void timer_init(uint16_t arr, uint16_t psr)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    lprintf("arr %x psr %x\n", arr, psr);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_DeInit(TIM2);
    TIM_InternalClockConfig(TIM2);
    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = arr;
    TIM_TimeBaseStructure.TIM_Prescaler = psr;
    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

